src/cf/DataProcessors/Тестирование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>Тестирование</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаЗнаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартаЗнанийСпециалиста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборТестов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/КартаЗнаний.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КартаЗнаний</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Верно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КартаЗнаний</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартаЗнанийСпециалиста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вопрос</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УровеньВладения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровеньВладения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/УровеньВладения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>УровеньВладения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗнаю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмеюПредставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗнаюХорошо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлубокиеЗнания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Эксперт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/КартаЗнанийСпециалиста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>КартаЗнанийСпециалиста</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпециализацияСотрудника</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборВопросов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Вопросы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Вопросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Вопросы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СодержаниеВопроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компетенция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компетенции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВариантыОтветов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правильный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/Тестирование/Forms/ФормаТестирования/Ext/Form/Module.bsl
&НаКлиенте
Процедура СледующийВопрос(Команда)    
	ЗафиксироватьРезультат();  
	Объект.НаборТестов.Очистить();
	Объект.ВариантыОтветов.Очистить();
	СледующийВопросНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗафиксироватьРезультат()
	
	Для каждого ТекущийВариант Из Объект.ВариантыОтветов Цикл
		Если ТекущийВариант.Ответ = Истина Тогда
			ВыбранныйВариантОтвета = ТекущийВариант.ВариантОтвета;
			Верно = ?(ПравильныйВариантОтвета=ВыбранныйВариантОтвета,Истина,Ложь);
		КонецЕсли;
	КонецЦикла;
		
	Если ЗначениеЗаполнено(ВыбранныйВариантОтвета) Тогда
		МЗ = РегистрыСведений.КартаЗнаний.СоздатьМенеджерЗаписи();
		МЗ.Сотрудник = Объект.Сотрудник;
		МЗ.КартаЗнаний = Объект.КартаЗнаний;
		МЗ.Вопрос = Вопрос;                    
		МЗ.УровеньВладения = ПолучитьСлучайноУровень();
		МЗ.Верно = Верно;
		МЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры	                                       

Функция ПолучитьСлучайноУровень()
	ГСЧ = новый ГенераторСлучайныхЧисел;
	Слчисло = ГСЧ.СлучайноеЧисло(1,5);
	Если Слчисло = 1 Тогда 
		Возврат Перечисления.УровеньВладения.ГлубокиеЗнания;
	ИначеЕсли Слчисло = 2 Тогда 
		Возврат Перечисления.УровеньВладения.ЗнаюХорошо;
	ИначеЕсли Слчисло = 3 Тогда 
		Возврат Перечисления.УровеньВладения.ИмеюПредставление;
	ИначеЕсли Слчисло = 4 Тогда 
		Возврат Перечисления.УровеньВладения.Эксперт;
	ИначеЕсли Слчисло = 5 Тогда 
		Возврат Перечисления.УровеньВладения.НеЗнаю;
	КонецЕсли;		
КонецФункции
	
&НаСервере
Процедура СледующийВопросНаСервере()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КартаЗнанийСпециалистаНаборВопросов.Вопрос КАК Вопрос
		|ИЗ
		|	Справочник.КартаЗнанийСпециалиста.НаборВопросов КАК КартаЗнанийСпециалистаНаборВопросов
		|ГДЕ
		|	КартаЗнанийСпециалистаНаборВопросов.Ссылка = &КартаЗнаний
		|	И КартаЗнанийСпециалистаНаборВопросов.Вопрос.Код > &КодПропуститьВопрос
		|
		|УПОРЯДОЧИТЬ ПО
		|	Вопрос";
		//|	И КартаЗнанийСпециалистаНаборВопросов.Вопрос.Код = &Код";
	Запрос.УстановитьПараметр("КартаЗнаний",Объект.КартаЗнаний); 
	Запрос.УстановитьПараметр("КодПропуститьВопрос",КодПропуститьВопрос);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВопросСтр = Объект.НаборТестов.Добавить();
			ВопросСтр.Вопрос = ВыборкаДетальныеЗаписи.Вопрос;
			Вопрос = ВопросСтр.Вопрос;       
			
		КонецЦикла;
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВопросыВариантыОтветов.ВариантОтвета КАК ВариантОтвета,
			|	ВопросыВариантыОтветов.Правильный КАК Правильный
			|ИЗ
			|	Справочник.Вопросы.ВариантыОтветов КАК ВопросыВариантыОтветов
			|ГДЕ
			|	ВопросыВариантыОтветов.Ссылка = &Вопрос
			|
			|УПОРЯДОЧИТЬ ПО
			|	ВариантОтвета"; 
		
		Запрос.УстановитьПараметр("Вопрос",Вопрос); 
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ВопросСтр = Объект.ВариантыОтветов.Добавить();
			ВопросСтр.ВариантОтвета = ВыборкаДетальныеЗаписи.ВариантОтвета;   
			Если ВыборкаДетальныеЗаписи.Правильный = Истина Тогда
				  ПравильныйВариантОтвета = ВопросСтр.ВариантОтвета;      
				  Сообщить(ПравильныйВариантОтвета);
			КонецЕсли;
		КонецЦикла;   
			
		КодПропуститьВопрос = Вопрос.Код;
		
	Иначе
		
		ОбщегоНазначения.СообщитьПользователю("Тестирование завершено!");
		Объект.НаборТестов.Очистить();
		Объект.ВариантыОтветов.Очистить();
		
    КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьТестирование(Команда)
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура НачатьТестирование(Команда)
	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(Объект.КартаЗнаний) И ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Объект.НаборТестов.Очистить();
		Объект.ВариантыОтветов.Очистить();  
		КодПропуститьВопрос = "";
		СледующийВопросНаСервере();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Объект.Сотрудник = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//ПараметрыВыбора = Новый Структура;
	//ПараметрыВыбора.Вставить("ОтборПоСотруднику",Объект.КартаЗнаний);
	//ОткрытьФорму("Справочник.Сотрудники.ФормаВыбора",ПараметрыВыбора,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)         
	Объект.КартаЗнаний = СотрудникПриИзмененииНаСервере(Объект.Сотрудник);
КонецПроцедуры

&НаСервереБезКонтекста
Функция СотрудникПриИзмененииНаСервере(Сотрудник)
	Должность = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сотрудник,"Должность");
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Должность,"ПерсональнаяКартаЗнаний");
КонецФункции
